SM_для_EDT/src/DataProcessors/рарусМониторОбменаСудна/рарусМониторОбменаСудна.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>рарусМониторОбменаСудна</name>
  <comment>rarus makole БСО.СМ.007</comment>
  <attributes>
    <name>ДатаПоследнейОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоследнегоОтправленного</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоследнегоПолученного</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОбмена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасписаниеОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегионРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемоеВремяЗагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемоеВремяВыгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеСудно</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйУзел</name>
    <type>
      <types>ExchangePlanRef.Полный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияКонфигурацииЦБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПодготовленоКЗагрузке</name>
    <attributes>
      <name>ВидОбъекта</name>
      <type>
        <types>EnumRef.рарусВидыОбъектовДляСинхронизации</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодготовленоКОтправке</name>
    <attributes>
      <name>ВидОбъекта</name>
      <type>
        <types>EnumRef.рарусВидыОбъектовДляСинхронизации</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Приоритет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеКОбмену</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>String</types>
        <types>DocumentRef</types>
        <types>CatalogRef</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выгружать</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьПоПравилу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолноеИмяТипа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>430</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КартинкаОбъект</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОставшийсяОбъем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

SM_для_EDT/src/InformationRegisters/рарусОбъектыПодготовленныеКЗагрузкеВГлавномУзле/рарусОбъектыПодготовленныеКЗагрузкеВГлавномУзле.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рарусОбъектыПодготовленныеКЗагрузкеВГлавномУзле</name>
  <comment>rarus makole БСО.СМ.007.03</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Узел</name>
    <type>
      <types>ExchangePlanRef.Полный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОбъекта</name>
    <type>
      <types>EnumRef.рарусВидыОбъектовДляСинхронизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вариант</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SM_для_EDT/src/DataProcessors/рарусМониторОбменаСудна/ObjectModule.bsl
Процедура ОбработатьСлужебныеДанные(АдресДанныхСБерега) Экспорт
	
	ДатаНачалаВыгрузки = ТекущаяДатаСеанса();
	
	Результат = ПолучитьИзВременногоХранилища(АдресДанныхСБерега);
	
	Если Результат.Свойство("ns") Тогда // Есть изменение настроек обмена, загрузим
		
		ДатаНачалаЗагрузки = ТекущаяДатаСеанса();
		рарусСинхронизацияССудном.ОбработатьМассивЗагруженныхОбъектов(Результат.ns, ГлавныйУзел);
		
		МассивНомеровОтЦентра = СтрРазделить(Результат.io,";",Истина);
		
		// ++ rarus makole 2021-06-29
		НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
		
		Попытка
			рарусСинхронизацияССудном.ЗаблокироватьУзел(ГлавныйУзел);
			ОбъектУзла = ГлавныйУзел.ПолучитьОбъект();
			ОбъектУзла.НомерПринятого = Число(МассивНомеровОтЦентра[1]);
			ОбъектУзла.Записать();
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Блокировка узла плана обмена'"), УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			// ++ rarus makole 2021-06-29
			рарусСинхронизацияССудном.ЗафиксироватьРезультатыОбменаВРегистрах(ГлавныйУзел,
																		Перечисления.ДействияПриОбмене.ЗагрузкаДанных,
																		Перечисления.РезультатыВыполненияОбмена.Ошибка,
																		ДатаНачалаЗагрузки,
																		ТекущаяДатаСеанса(),
																		Число(МассивНомеровОтЦентра[1]),
																		ИмяКомпьютера());
			// -- rarus makole 2021-06-29
	      	ВызватьИсключение("Не удалось установить новый номер полученного сообщения в узле судна, повторите попытку позднее");
		КонецПопытки;
		// -- rarus makole 2021-06-29
	
		// ++ rarus makole 2021-06-29
		рарусСинхронизацияССудном.ЗафиксироватьРезультатыОбменаВРегистрах(ГлавныйУзел,
																	Перечисления.ДействияПриОбмене.ЗагрузкаДанных,
																	Перечисления.РезультатыВыполненияОбмена.Выполнено,
																	ДатаНачалаЗагрузки,
																	ТекущаяДатаСеанса(),
																	Число(МассивНомеровОтЦентра[1]),
																	ИмяКомпьютера());
		// -- rarus makole 2021-06-29
																	
	КонецЕсли;
	
	// ++ rarus makole 2021-03-26 [Задача № 27965]
	ВерсияКонфигурацииЦБ = Результат.ver;
	// -- rarus makole 2021-03-26 [Задача № 27965]
	Обработки.рарусМониторОбменаСудна.ЗаполнитьТаблицуПодготовленных(ПодготовленоКЗагрузке, Результат.oo);
	СохранитьИнформациюОПодготовленныхКЗагрузке(ГлавныйУзел, ВариантОбмена, ПодготовленоКЗагрузке);
	
КонецПроцедуры

Процедура СохранитьИнформациюОПодготовленныхКЗагрузке(Узел, Вариант, Знач ТЧДанныеКСохранению)
	
	ДанныеКСохранению = ТЧДанныеКСохранению.Выгрузить();
	НаборЗаписей = РегистрыСведений.рарусОбъектыПодготовленныеКЗагрузкеВГлавномУзле.СоздатьНаборЗаписей(); 

	НаборЗаписей.Отбор.Узел.Установить(Узел); 
	НаборЗаписей.Отбор.Вариант.Установить(Вариант); 

	Для каждого СтрокаКСохранению Из ДанныеКСохранению Цикл
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.Узел = Узел; 
		НоваяЗапись.Вариант = Вариант; 
		НоваяЗапись.ВидОбъекта = СтрокаКСохранению.ВидОбъекта; 
		НоваяЗапись.Количество = СтрокаКСохранению.Количество;
		НоваяЗапись.Размер = СтрокаКСохранению.Объем;
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры
